import 'package:places/src/feature/sight/data/models/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Республиканский театр кукол',
    lat: 47.90855,
    lon: 56.637057,
    url:
        'https://avatars.mds.yandex.net/get-altay/4449685/2a000001826a0b016ee765afbf97649c35f7/XXXL',
    details:
        'Кукольный театр, основанный в 1942 году в городе Йошкар-Ола Марийской АССР. В театре играются спектакли на русском и марийском языках.',
    type: 'Театр',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Национальная художественная галерея',
    lat: 47.886962,
    lon: 56.631895,
    url:
        'https://avatars.mds.yandex.net/get-altay/1042100/2a00000168d5741eaf1f16344b0b9169a2e1/XXXL',
    details:
        'Структурное подразделение Республиканского музея изобразительных искусств в городе Йошкар-Ола. Открыта 4 ноября 2007 года. Помимо постоянной экспозиции картин художников Марий Эл, в галерее регулярно проходят выставки различных коллекций музеев России и мира, а также частных коллекций.',
    type: 'Исскуство',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Марийский государственный театр оперы и балета имени Эрика Сапаева',
    lat: 47.890508,
    lon: 56.6329,
    url:
        'https://avatars.mds.yandex.net/get-altay/1546166/2a0000016ae326bbdb27cac0381065889901/XXXL',
    details:
        'Стационарный театр оперы и балета в Йошкар-Оле, основан в 1968 году как музыкально-драматический театр, нынешний статус с 1994 года.',
    type: 'Театр',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Йошкар-олинский Дворец бракосочетаний',
    lat: 47.912333,
    lon: 56.632701,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/yoshkar-ola-wedding-palace.jpg',
    details:
        'К сожалению, большинство мест рождения новых семей назвать Дворцами бракосочетаний можно лишь с большой натяжкой. Эти серые унылые бетонные коробки мало ассоциируются со словом «дворец», им больше подходит сухая аббревиатура ЗАГС. Йошкар-олинский Дворец бракосочетаний служит редким исключением из этой закономерности. Он столь прекрасен, что одного взгляда на него достаточно, чтобы появилась желание бежать под венец. Многим соотечественникам остается только завидовать молодым йошкар-олинским парам, чья семейная жизнь начиналась со сказки.',
    type: 'Загс',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Благовещенская башня',
    lat: 47.902656,
    lon: 56.63374,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/copy-of-the-spasskaya-tower.jpg',
    details:
        'В Йошкар-Оле можно найти не только частицу Брюгге и других западноевропейских городов, но и частичку Москвы. Действительно, перейдя Кокшагу по Театральному мосту и ступив на площадь Республики, вы увидите перед собой… Спасскую башню. Конечно, это всего лишь копия самой знаменитой башни Московского Кремля, причем уменьшенная – 55 метров в высоту против 70 метров оригинала.',
    type: 'Башня',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Кафедральный собор Благовещения Пресвятой Богородицы',
    lat: 47.904463,
    lon: 56.632946,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/the-annunciation-cathedral.jpg',
    details:
        'На Воскресенской набережной стоит собор Благовещения Богородицы, являющийся центральным элементом архитектурного комплекса с площадью Республики и Пресвятой Девы Марии посередине. В основу проекта, по которому строился этот собор, лег архитектурный план петербургского храма Спаса-на-Крови, но точной копией последнего марийская церковь не является.',
    type: 'Собор',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Бульвар Чавайна',
    lat: 47.892391,
    lon: 56.630448,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/chawain-boulevard.jpg',
    details:
        'Бульвар Чавайна, названный так в честь марийского поэта, считающегося основателем национальной поэзии и литературы, Сергея Чавайна, – самая длинная пешеходная улица Йошкар-Олы. Она тянется от улицы Кирова до набережной Брюгге. Перейдя реку по Театральному мосту, вы обнаружите продолжение бульвара, который затем плавно переходит в Центральный парк культуры и отдыха.',
    type: 'Бульвар',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Сквер у Дома Правительство Республики Марий Эл',
    lat: 47.883672,
    lon: 56.630387,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/square-at-the-government-house-yoshkar-ola.jpg',
    details:
        'На территории, прилегающей к Дому правительства республики Марий Эл, что на Ленинском проспекте, напротив площади Оболенского-Ноготкова, разбит небольшой, но очень симпатичный сквер. Голубые ели, красивые цветники, привлекательный фонтан… Жители города любили приходить сюда, чтобы просто погулять вдоль клумб, посидеть на лавочке, наслаждаясь окружающей красотой. Молодожены традиционно устраивали здесь свои фотосессии.',
    type: 'Сквер',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Площадь Оболенского-Ноготкова',
    lat: 47.886962,
    lon: 56.631895,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/obolensky-nogotkov-square.jpg',
    details:
        'Иван Андреевич Ноготков-Оболенский, в честь которого названа эта площадь, был по сути основателем города. Именно его в 1584 году царь Федор Иоаннович послал в качестве воеводы в созданный царским указом новый город – Царевококшайск. В самом сердце площади стоит 6-метровый бронзовый монумент Ивану Оболенскому-Ноготкову работы скульптора Андрея Ковальчука. С осмотра этого памятника сегодня начинаются почти все экскурсии по Йошкар-Оле.',
    type: 'Площадь',
    clousedBefore: '09:00',
  ),
  Sight(
    name: 'Ботанический сад-институт ПГТУ',
    lat: 47.963053,
    lon: 56.620196,
    url:
        'https://tripplanet.ru/wp-content/uploads/europe/russia/yoshkar-ola/botanical-garden-institute-pstu.jpg',
    details:
        'Ботанический сад Поволжского государственного технологического университета был заложен в 1927 году, он стал первым дендрологическим питомником на территории республики Марий Эл. В 1932 году питомник передали только что открытому Поволжскому лесотехническому институту в качестве его учебно-научной базы для подготовки специалистов. Уже тогда в нем выращивалось около 200 видов древесных растений. В 1939 года при питомнике создан дендрарий.',
    type: 'Сад',
    clousedBefore: '09:00',
  ),
];
